Core/src/AccumulationRegisters/Продажи/Продажи.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Продажи</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаНДС</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Себестоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <type>
      <types>CatalogRef.ХозяйственныеОперации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоПодарок</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Характеристика</name>
    <type>
      <types>CatalogRef.ХарактеристикиНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Партия</name>
    <type>
      <types>CatalogRef.ПартииНоменклатуры</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Документ</name>
    <type>
      <types>DocumentRef.РасходнаяНакладная</types>
      <types>DocumentRef.ОтчетКомиссионера</types>
      <types>DocumentRef.ПриходнаяНакладная</types>
      <types>DocumentRef.АктВыполненныхРабот</types>
      <types>DocumentRef.ЧекККМ</types>
      <types>DocumentRef.ОтчетОПереработке</types>
      <types>DocumentRef.АвансовыйОтчет</types>
      <types>DocumentRef.ЗаказПокупателя</types>
      <types>DocumentRef.ПродажаЛицензии</types>
      <types>DocumentRef.ОтчетОРозничныхПродажах</types>
      <types>DocumentRef.ОтчетКомитенту</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтавкаНДС</name>
    <type>
      <types>CatalogRef.СтавкиНДС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктурныеЕдиницы</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyАналитикаКонтрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyПроект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>AzRyШтрихкодыНоменклатуры</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Core/src/Enums/ВидыОперацийПриходнаяНакладная/ВидыОперацийПриходнаяНакладная.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыОперацийПриходнаяНакладная</name>
  <enumValues>
    <name>ПоступлениеОтПоставщика</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаКомиссию</name>
  </enumValues>
  <enumValues>
    <name>ПриемВПереработку</name>
  </enumValues>
  <enumValues>
    <name>ПриемНаОтветхранение</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПокупателя</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтКомиссионера</name>
  </enumValues>
  <enumValues>
    <name>ВозвратОтПереработчика</name>
  </enumValues>
  <enumValues>
    <name>ВозвратСОтветхранения</name>
  </enumValues>
  <enumValues>
    <name>ЗакупкаКапитальныхЗатрат</name>
  </enumValues>
</mdclass:Enum>

Core/src/Catalogs/Проекты/Проекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Проекты</name>
  <hierarchical>true</hierarchical>
  <hierarchyType>HierarchyOfItems</hierarchyType>
  <predefined>
    <items>
      <name>БезПроекта</name>
      <description>პროექტის გარეშე</description>
    </items>
  </predefined>
  <attributes>
    <name>ДатаНачала</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОкончания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRy_ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyТипыПроектов</name>
    <type>
      <types>EnumRef.AzRyТипыПроектов</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyJiraProject</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyНаправленияДеятельности</name>
    <type>
      <types>CatalogRef.НаправленияДеятельности</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyDivision</name>
    <type>
      <types>CatalogRef.AzRyDivision</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectID</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectType</name>
    <type>
      <types>EnumRef.AzRyTempoObjects</types>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectKey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>15</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>AzRyTempoObjectName</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>AzRytmpТаблицаКонтрагентов</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Core/src/CommonModules/БаллыЛояльностьСкидки/Module.bsl
Функция ПолучитьКоэффициентЛояльности(КартаЛояльности, Дата) Экспорт
	
	Результат = 0;
	
	Если КартаДействительна(КартаЛояльности, Дата) Тогда
		Результат = КартаЛояльности.Владелец.КоэфициентПересчета;	
	КонецЕсли;	
	
	Возврат Результат; //КоэффициентЛояльности;
	
КонецФункции

Функция КартаДействительна(КартаЛояльности, Дата) Экспорт
	Результат = Ложь;
	
	Если ЗначениеЗаполнено(КартаЛояльности) 
		и (Дата <= КонецДня(КартаЛояльности.ДатаОкончания) и Дата>= НачалоДня(КартаЛояльности.ДатаНачала)) Тогда
		Результат = Истина;	
	КонецЕсли;	
	
	Возврат Результат;
КонецФункции	


Функция ПолучитьПроцентСкидкиЛояльности_РасходнаяНакладная(Объект) Экспорт
	
	ВсегоПоДокументу = 0;
	ВсегоПоДокументуНакопление = 0;
	ПроцентНакопительнойСкидки = 0;
	
	
	//Малышев 2024-12-06 - проверим на годность карты
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) и (Объект.Дата> Объект.КартаЛояльности.ДатаОкончания или Объект.Дата< Объект.КартаЛояльности.ДатаНачала) Тогда
		Возврат ПроцентНакопительнойСкидки;	
	КонецЕсли;	
	
	
	
	тзЗапасы = Объект.Запасы.Выгрузить(,"Количество, Цена, Всего");
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
			
	//Малышев 2024-11-06	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	тзЗапасы.Цена КАК Цена,
	|	тзЗапасы.Количество КАК Количество,
	|	тзЗапасы.Всего КАК Всего
	|ПОМЕСТИТЬ ВТ_ЗапасыТекущегоДокумента
	|ИЗ
	|	&тзЗапасы КАК тзЗапасы
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	//|	СУММА(Т.Цена * Т.Количество) КАК СуммаДокБезСкидок
	|	СУММА(Т.Всего) КАК СуммаДокБезСкидок  //Малышев 2024-12-19 меняем базу для рассчета 
	|ПОМЕСТИТЬ ВТ_ПродажиТекущегоДокумента
	|ИЗ
	|	ВТ_ЗапасыТекущегоДокумента КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Пороги.Скидка КАК Скидка,
	|	Пороги.НижняяГраница КАК НижняяГраница
	|ПОМЕСТИТЬ ВТ_Пороги
	|ИЗ
	|	Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок КАК Пороги
	|ГДЕ
	|	Пороги.Ссылка = &ВидДисконтнойКарты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ВидыКартЛояльностиПорогиНакопительныхСкидок1.Скидка,
	|	ВидыКартЛояльностиПорогиНакопительныхСкидок1.НижняяГраница
	|ИЗ
	|	Справочник.ВидыКартЛояльности.ПорогиНакопительныхСкидок1 КАК ВидыКартЛояльностиПорогиНакопительныхСкидок1
	|ГДЕ
	|	ВидыКартЛояльностиПорогиНакопительныхСкидок1.Ссылка = &ВидДисконтнойКарты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СУММА(Т.СуммаОборот) КАК СуммаОборот
	|ПОМЕСТИТЬ ВременнаяТаблицаПродаж
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(СУММА(РегПродажи.СуммаОборот), 0) КАК СуммаОборот
	|	ИЗ
	|		РегистрНакопления.Продажи.Обороты(&ДатаНачалаПродаж, &ДатаКон, Регистратор, Контрагент = &Контрагент) КАК РегПродажи
	|	ГДЕ
	|		РегПродажи.Регистратор <> &Ссылка
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		ПродажиТекущегоДокумента.СуммаДокБезСкидок
	|	ИЗ
	|		ВТ_ПродажиТекущегоДокумента КАК ПродажиТекущегоДокумента) КАК Т
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РегПороги.Скидка КАК Скидка
	|ИЗ
	|	(ВЫБРАТЬ
	|		ЕСТЬNULL(СУММА(РегПродажи.СуммаОборот), 0) КАК СуммаОборот
	|	ИЗ
	|		ВременнаяТаблицаПродаж КАК РегПродажи) КАК РегПродажи
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			Пороги.НижняяГраница КАК НижняяГраница,
	|			Пороги.Скидка КАК Скидка
	|		ИЗ
	|			ВТ_Пороги КАК Пороги) КАК РегПороги
	|		ПО (РегПороги.НижняяГраница <= РегПродажи.СуммаОборот)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|			МАКСИМУМ(РегПороги.НижняяГраница) КАК НижняяГраница
	|		ИЗ
	|			ВременнаяТаблицаПродаж КАК РегПродажи
	|				ВНУТРЕННЕЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	|					Пороги.НижняяГраница КАК НижняяГраница
	|				ИЗ
	|					ВТ_Пороги КАК Пороги) КАК РегПороги
	|				ПО (РегПороги.НижняяГраница <= РегПродажи.СуммаОборот)) КАК РегПорогиМакс
	|		ПО (РегПорогиМакс.НижняяГраница = РегПороги.НижняяГраница)";
	
	
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);    
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда 
		Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);  
	Иначе
		Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДата());
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("КартаЛояльности", Объект.КартаЛояльности);   
	Запрос.УстановитьПараметр("ДатаНачалаПродаж", Объект.КартаЛояльности.ДатаНачала); //Малышев 2024-11-05 ONESOFT-3574  
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	
	
	
	//***************
	ДатаСкидки = Объект.Дата; 
	ПериодНакопления = УправлениеНебольшойФирмойСервер.ПолучитьПериодРасчетаНакопительныхСкидокПоДисконтнойКарте(ДатаСкидки, Объект.КартаЛояльности.Ссылка);
	Запрос.УстановитьПараметр("ДатаНач", ПериодНакопления.НачалоПериода);
	Запрос.УстановитьПараметр("ДатаКон", ДатаСкидки);
 	Запрос.УстановитьПараметр("ВидДисконтнойКарты", Объект.КартаЛояльности.Владелец);   
		
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ПроцентНакопительнойСкидки = Выборка.Скидка;
	Иначе
		ПроцентНакопительнойСкидки = 0;
	КонецЕсли;		
	
	Возврат ПроцентНакопительнойСкидки;
	
КонецФункции


Функция ПолучитьПроцентСкидкиЛояльности_РасходнаяНакладная_2024_12_31(Объект) Экспорт
	
	//Малышев 2024-12-06 - проверим на годность карты
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) и (Объект.Дата> Объект.КартаЛояльности.ДатаОкончания или Объект.Дата< Объект.КартаЛояльности.ДатаНачала) Тогда
		Возврат 0;	
	КонецЕсли;	
	
	ВсегоПоДокументу = 0;
	тзЗапасы = Объект.Запасы.Выгрузить(,"Количество, Цена, Всего");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	тзЗапасы.Цена КАК Цена,
		//|	тзЗапасы.Количество КАК Количество
		//|ПОМЕСТИТЬ ВТ_Запасы
		//|ИЗ
		//|	&тзЗапасы КАК тзЗапасы
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЕСТЬNULL(СУММА(ВТ_Запасы.Цена * ВТ_Запасы.Количество), 0) КАК СуммаБезСкидок,
		//|	ЕСТЬNULL(СУММА(БалыЛояльностиОбороты.СуммаОборот), 0) КАК СуммаБезСкидокНакопление
		//|ИЗ
		//|	ВТ_Запасы КАК ВТ_Запасы
		//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.БалыЛояльности.Обороты(
		//|				,
		//|				&ДатаДокумента,
		//|				Регистратор,
		//|				Контрагент = &Контрагент
		//|					И КартаЛояльности = &КартаЛояльности) КАК БалыЛояльностиОбороты
		//|		ПО (ИСТИНА)
		//|ГДЕ
		//|	БалыЛояльностиОбороты.Регистратор <> &Ссылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВложенныйЗапрос.СуммаДокБезСкидок + ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0) КАК ВсегоСДокументов
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ВТ_Запасы.Цена * ВТ_Запасы.Количество КАК СуммаДокБезСкидок
		//|	ИЗ
		//|		ВТ_Запасы КАК ВТ_Запасы
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		ВТ_Запасы.Цена * ВТ_Запасы.Количество) КАК ВложенныйЗапрос
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, &ДатаДокумента, Регистратор, Контрагент = &Контрагент) КАК ПродажиОбороты
		//|		ПО (ИСТИНА)
		//|ГДЕ
		//|	ПродажиОбороты.Регистратор <> &Ссылка";
		"ВЫБРАТЬ
		|	тзЗапасы.Всего КАК Всего,
		|	тзЗапасы.Цена КАК Цена,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТ_Запасы.Всего), 0) КАК СуммаБезСкидок,
		|	ЕСТЬNULL(СУММА(БалыЛояльностиОбороты.СуммаОборот), 0) КАК СуммаБезСкидокНакопление
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.БалыЛояльности.Обороты(
		|				&ДатаНачалаПодаж,
		|				&ДатаДокумента,
		|				Регистратор,
		|				Контрагент = &Контрагент
		|					И КартаЛояльности = &КартаЛояльности) КАК БалыЛояльностиОбороты
		|		ПО (ИСТИНА)
		|ГДЕ
		|	БалыЛояльностиОбороты.Регистратор <> &Ссылка
		|;
		|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВложенныйЗапрос.СуммаДокБезСкидок + ЕСТЬNULL(ВложенныйЗапрос1.СуммаОборот, 0) КАК ВсегоСДокументов
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ВТ_Запасы.Цена * ВТ_Запасы.Количество КАК СуммаДокБезСкидок
		//|	ИЗ
		//|		ВТ_Запасы КАК ВТ_Запасы
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		ВТ_Запасы.Цена * ВТ_Запасы.Количество) КАК ВложенныйЗапрос
		//|		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		//|			СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
		//|		ИЗ
		//|			РегистрНакопления.Продажи.Обороты(, &ДатаДокумента, Регистратор, Контрагент = &Контрагент) КАК ПродажиОбороты
		//|		ГДЕ
		//|			ПродажиОбороты.Регистратор <> &Ссылка) КАК ВложенныйЗапрос1
		//|		ПО (ИСТИНА)
		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВложенныйЗапрос.СуммаДокБезСкидок + ЕСТЬNULL(ВложенныйЗапрос1.СуммаОборот, 0) КАК ВсегоСДокументов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Запасы.Всего КАК СуммаДокБезСкидок
		|	 ИЗ
		|		ВТ_Запасы КАК ВТ_Запасы
		|	
		|	 СГРУППИРОВАТЬ ПО
		|		ВТ_Запасы.Всего) КАК ВложенныйЗапрос
		|	ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
		|			СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
		|		ИЗ
		|			РегистрНакопления.Продажи.Обороты(&ДатаНачалаПодаж, &ДатаДокумента, Регистратор, Контрагент = &Контрагент) КАК ПродажиОбороты
		|		ГДЕ
		|			ПродажиОбороты.Регистратор <> &Ссылка) КАК ВложенныйЗапрос1
		|		ПО (ИСТИНА)
		
		|";
	
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);    
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда 
		Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);  
	Иначе
		Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДата());
	КонецЕсли; 
	
	Запрос.УстановитьПараметр("ДатаНачалаПодаж", Объект.КартаЛояльности.ДатаНачала); //Малышев 2024-12-26
	
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("КартаЛояльности", Объект.КартаЛояльности);   
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = МассивРезультатов[1].Выбрать();
	ВыборкаНакопления = МассивРезультатов[2].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВсегоПоДокументу = ВыборкаДетальныеЗаписи.СуммаБезСкидок;       
		ВсегоПоДокументуНакопление = ВыборкаДетальныеЗаписи.СуммаБезСкидокНакопление + ВыборкаДетальныеЗаписи.СуммаБезСкидок;
	КонецЦикла;
	
	ВсегоНакоплено = 0;
	Пока ВыборкаНакопления.Следующий() Цикл
		ВсегоНакоплено = ВыборкаНакопления.ВсегоСДокументов;       
	КонецЦикла;
	
	СуммаПорогаПоКарте = 0;
	ПроцентПорога = 0;     
	
	Если Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() > 0 Тогда   
		
		СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[0].НижняяГраница;
		
		Для Сч = 0 По Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() - 1 Цикл 
			
			Если ВсегоНакоплено >= СуммаПорогаПоКарте Тогда 
				ПроцентПорога = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[СЧ].Скидка;
				Если Сч <> Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() - 1 Тогда 
					СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[СЧ+1].НижняяГраница;
				Иначе
					Прервать;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;     
		
		Если ПроцентПорога <> 0 Тогда  
			Возврат ПроцентПорога;
		КонецЕсли;    
		
	КонецЕсли;
	
	Если Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() > 0 Тогда  
		
		СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[0].НижняяГраница;
		
		Для Сч = 0 По Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Цикл 
			
			Если ВсегоПоДокументу >= СуммаПорогаПоКарте Тогда 
				ПроцентПорога = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ].Скидка;
				Если Сч <> Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Тогда 
					СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ+1].НижняяГраница;
				Иначе
					Прервать;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЕсли;
	
	Возврат ПроцентПорога;

КонецФункции

Функция ПолучитьПроцентСкидкиЛояльности_РасходнаяНакладная_2024_11_06(Объект) Экспорт  //Старая версия
	
	ВсегоПоДокументу = 0;
	ВсегоПоДокументуНакопление = 0;
	
	тзЗапасы = Объект.Запасы.Выгрузить(,"Количество, Цена");
	
	Запрос = Новый Запрос; 
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	тзЗапасы.Цена КАК Цена,
		//|	тзЗапасы.Количество КАК Количество
		//|ПОМЕСТИТЬ ВТ_Запасы
		//|ИЗ
		//|	&тзЗапасы КАК тзЗапасы
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЕСТЬNULL(СУММА(ВТ_Запасы.Цена * ВТ_Запасы.Количество), 0) КАК СуммаБезСкидок,
		//|	ЕСТЬNULL(СУММА(БалыЛояльностиОбороты.СуммаОборот), 0) КАК СуммаБезСкидокНакопление
		//|ИЗ
		//|	ВТ_Запасы КАК ВТ_Запасы
		//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.БалыЛояльности.Обороты(
		//|				,
		//|				&ДатаДокумента,
		//|				Регистратор,
		//|				Контрагент = &Контрагент
		//|					И КартаЛояльности = &КартаЛояльности) КАК БалыЛояльностиОбороты
		//|		ПО (ИСТИНА)
		//|ГДЕ
		//|	БалыЛояльностиОбороты.Регистратор <> &Ссылка
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ВложенныйЗапрос.СуммаДокБезСкидок + ЕСТЬNULL(ПродажиОбороты.СуммаОборот, 0) КАК ВсегоСДокументов
		//|ИЗ
		//|	(ВЫБРАТЬ
		//|		ВТ_Запасы.Цена * ВТ_Запасы.Количество КАК СуммаДокБезСкидок
		//|	ИЗ
		//|		ВТ_Запасы КАК ВТ_Запасы
		//|	
		//|	СГРУППИРОВАТЬ ПО
		//|		ВТ_Запасы.Цена * ВТ_Запасы.Количество) КАК ВложенныйЗапрос
		//|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.Продажи.Обороты(, &ДатаДокумента, Регистратор, Контрагент = &Контрагент) КАК ПродажиОбороты
		//|		ПО (ИСТИНА)
		//|ГДЕ
		//|	ПродажиОбороты.Регистратор <> &Ссылка";
		
		"ВЫБРАТЬ
		|	тзЗапасы.Цена КАК Цена,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы2
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	СУММА(Т.Цена * Т.Количество) КАК СуммаДокБезСкидок
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	ВТ_Запасы2 КАК Т
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ЕСТЬNULL(ВТ_Запасы.СуммаДокБезСкидок, 0)),0) КАК СуммаБезСкидок,
		|	ЕСТЬNULL(СУММА(ЕСТЬNULL(БалыЛояльностиОбороты.СуммаОборот, 0)),0) КАК СуммаБезСкидокНакопление
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы
		|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.БалыЛояльности.Обороты(
		|				,
		|				&ДатаДокумента,
		|				Регистратор,
		|				Контрагент = &Контрагент
		|					И КартаЛояльности = &КартаЛояльности
		|					И (&ДатаДокумента МЕЖДУ КартаЛояльности.ДатаНачала И КартаЛояльности.ДатаОкончания)) КАК БалыЛояльностиОбороты
		|		ПО (ИСТИНА)
		|ГДЕ
		|	БалыЛояльностиОбороты.Регистратор <> &Ссылка
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(ВложенныйЗапрос.СуммаДокБезСкидок,0) + ЕСТЬNULL(ВложенныйЗапрос1.СуммаОборот, 0) КАК ВсегоСДокументов
		|ИЗ
		|	(ВЫБРАТЬ
		|		ВТ_Запасы.СуммаДокБезСкидок КАК СуммаДокБезСкидок
		|	ИЗ
		|		ВТ_Запасы КАК ВТ_Запасы) КАК ВложенныйЗапрос
		|	ЛЕВОЕ СОЕДИНЕНИЕ 
		|			(ВЫБРАТЬ
		|				СУММА(ПродажиОбороты.СуммаОборот) КАК СуммаОборот
		|			 ИЗ
		|				РегистрНакопления.Продажи.Обороты(&ДатаНачалаПродаж, &ДатаДокумента, Регистратор, Контрагент = &Контрагент) КАК ПродажиОбороты
		|			 ГДЕ
		|				ПродажиОбороты.Регистратор <> &Ссылка) КАК ВложенныйЗапрос1
		|		ПО (ИСТИНА)";
		
		
		
		
	
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);    
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда 
		Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);  
	Иначе
		Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДата());
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("КартаЛояльности", Объект.КартаЛояльности);   
	Запрос.УстановитьПараметр("ДатаНачалаПродаж", Объект.КартаЛояльности.ДатаНачала); //Малышев 2024-11-05 ONESOFT-3574  
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	МассивРезультатов = Запрос.ВыполнитьПакет();
	
	ВыборкаДетальныеЗаписи = МассивРезультатов[2].Выбрать();
	ВыборкаНакопления = МассивРезультатов[3].Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВсегоПоДокументу = ВыборкаДетальныеЗаписи.СуммаБезСкидок;       
		ВсегоПоДокументуНакопление = ВыборкаДетальныеЗаписи.СуммаБезСкидокНакопление + ВыборкаДетальныеЗаписи.СуммаБезСкидок;
	КонецЦикла;
	
	ВсегоНакоплено = 0;
	Пока ВыборкаНакопления.Следующий() Цикл
		ВсегоНакоплено = ВыборкаНакопления.ВсегоСДокументов;       
	КонецЦикла;
	
	СуммаПорогаПоКарте = 0;
	ПроцентПорога = 0;     
	
	Если Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() > 0 Тогда   
		
		СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[0].НижняяГраница;
		
		Для Сч = 0 По Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() - 1 Цикл 
			
			Если ВсегоНакоплено >= СуммаПорогаПоКарте Тогда 
				ПроцентПорога = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[СЧ].Скидка;
				Если Сч <> Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() - 1 Тогда 
					СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[СЧ+1].НижняяГраница;
				Иначе
					Прервать;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;     
		
		Если ПроцентПорога <> 0 Тогда  
			Возврат ПроцентПорога;
		КонецЕсли;    
		
	КонецЕсли;
	
	Если Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() > 0 Тогда  
		
		СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[0].НижняяГраница;
		
		Для Сч = 0 По Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Цикл 
			
			Если ВсегоПоДокументу >= СуммаПорогаПоКарте Тогда 
				ПроцентПорога = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ].Скидка;
				Если Сч <> Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Тогда 
					СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ+1].НижняяГраница;
				Иначе
					Прервать;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;  
		
	КонецЕсли;
	
	Возврат ПроцентПорога;

КонецФункции


Функция ПолучитьКоличествоДоступныхБалов_РасходнаяНакладная(ДокСсылка = Неопределено, КартаЛояльности, Контрагент, ДатаДокумента, КоэффициентЛояльности, МенятьКоэффициентЛояльности = Истина) Экспорт

	ДатаНачалаДействияКарты = КартаЛояльности.ДатаНачала;
	
	Запрос = Новый Запрос;
	//Запрос.Текст = 
	//	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	//	|	БалыЛояльностиОбороты.КартаЛояльности КАК КартаЛояльности,
	//	|	БалыЛояльностиОбороты.Контрагент КАК Контрагент,
	//	|	СУММА(БалыЛояльностиОбороты.КоличествоОборот) КАК КоличествоОборот
	//	|ИЗ
	//	|	РегистрНакопления.БалыЛояльности.Обороты(
	//	|			&ДатаНачала,
	//	|			&ДатаОкончания,
	//	|			Регистратор,
	//	|			КартаЛояльности = &КартаЛояльности
	//	|				И Контрагент = &Контрагент) КАК БалыЛояльностиОбороты
	//	|ГДЕ
	//	|	БалыЛояльностиОбороты.Регистратор <> &Ссылка
	//	|
	//	|СГРУППИРОВАТЬ ПО
	//	|	БалыЛояльностиОбороты.КартаЛояльности,
	//	|	БалыЛояльностиОбороты.Контрагент";
	
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	БалыЛояльностиОбороты.КартаЛояльности КАК КартаЛояльности,
	|	БалыЛояльностиОбороты.Контрагент КАК Контрагент,
	|	СУММА(БалыЛояльностиОбороты.КоличествоОстаток) КАК КоличествоОборот
	|ИЗ
	|	РегистрНакопления.БалыЛояльности.Остатки(
	|			&ДатаОкончания,
	|			КартаЛояльности = &КартаЛояльности
	|				И Контрагент = &Контрагент) КАК БалыЛояльностиОбороты
	|
	|СГРУППИРОВАТЬ ПО
	|	БалыЛояльностиОбороты.КартаЛояльности,
	|	БалыЛояльностиОбороты.Контрагент";
	
	Запрос.УстановитьПараметр("ДатаНачала", ДатаНачалаДействияКарты);
	Запрос.УстановитьПараметр("ДатаОкончания", ?(ДатаДокумента = НачалоДня(ТекущаяДата()), ТекущаяДата(), ДатаДокумента));
	Запрос.УстановитьПараметр("ДатаОкончания", Новый Граница(ДатаДокумента, ВидГраницы.Исключая));
	Запрос.УстановитьПараметр("КартаЛояльности", КартаЛояльности);
	Запрос.УстановитьПараметр("Контрагент", Контрагент);  
	Запрос.УстановитьПараметр("Ссылка", ДокСсылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если  МенятьКоэффициентЛояльности и КоэффициентЛояльности <> КартаЛояльности.Владелец.КоэфициентПересчета Тогда                              
		КоэффициентЛояльности = КартаЛояльности.Владелец.КоэфициентПересчета;
	КонецЕсли;	
	
	КолвоБалов = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		КолвоБалов = ВыборкаДетальныеЗаписи.КоличествоОборот;
	КонецЦикла;
	
	Возврат КолвоБалов;

КонецФункции

Функция ПолучитьПроцентНакопленияБаллов_РасходнаяНакладная(Объект) Экспорт
	
	Если ЗначениеЗаполнено(Объект.КартаЛояльности) и (Объект.Дата> Объект.КартаЛояльности.ДатаОкончания или Объект.Дата< Объект.КартаЛояльности.ДатаНачала) Тогда
		Возврат 0;	
	КонецЕсли;	
	
	ВсегоПоДокументу = 0; 
	ВсегоПоДокументуНакопление = 0;
	
	тзЗапасы = Объект.Запасы.Выгрузить(,"Количество, Цена, Всего");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		//"ВЫБРАТЬ
		//|	тзЗапасы.Цена КАК Цена,
		//|	тзЗапасы.Количество КАК Количество
		//|ПОМЕСТИТЬ ВТ_Запасы
		//|ИЗ
		//|	&тзЗапасы КАК тзЗапасы
		//|;
		//|
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЕСТЬNULL(СУММА(ВТ_Запасы.Цена * ВТ_Запасы.Количество), 0) КАК СуммаБезСкидок,
		//|	ЕСТЬNULL(СУММА(БалыЛояльностиОбороты.СуммаОборот), 0) КАК СуммаБезСкидокНакопление
		//|ИЗ
		//|	ВТ_Запасы КАК ВТ_Запасы
		//|		ПОЛНОЕ СОЕДИНЕНИЕ РегистрНакопления.БалыЛояльности.Обороты(
		//|				,
		//|				&ДатаДокумента,
		//|				,
		//|				Контрагент = &Контрагент
		//|					И КартаЛояльности = &КартаЛояльности) КАК БалыЛояльностиОбороты
		//|		ПО (ИСТИНА)";  
		"ВЫБРАТЬ
		|	тзЗапасы.Всего КАК Всего,
		|	тзЗапасы.Цена КАК Цена,
		|	тзЗапасы.Количество КАК Количество
		|ПОМЕСТИТЬ ВТ_Запасы
		|ИЗ
		|	&тзЗапасы КАК тзЗапасы
		|;
		|
		
		//
		//|////////////////////////////////////////////////////////////////////////////////
		//|ВЫБРАТЬ
		//|	ЕСТЬNULL(СУММА(ВТ_Запасы.Цена * ВТ_Запасы.Количество), 0) КАК СуммаБезСкидок,
		//|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.СуммаОборот), 0) КАК СуммаБезСкидокНакопление
		//|ИЗ
		//|	ВТ_Запасы КАК ВТ_Запасы,
		//|	(ВЫБРАТЬ
		//|		СУММА(БалыЛояльностиОбороты.СуммаОборот) КАК СуммаОборот
		//|	ИЗ
		//|		РегистрНакопления.БалыЛояльности.Обороты(, &ДатаДокумента, Регистратор, Контрагент = &Контрагент) КАК БалыЛояльностиОбороты
		//|	ГДЕ
		//|		БалыЛояльностиОбороты.Регистратор <> &Ссылка
		//|) КАК ВложенныйЗапрос
		
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(ВТ_Запасы.Всего), 0) КАК СуммаБезСкидок,
		|	ЕСТЬNULL(СУММА(ВложенныйЗапрос.СуммаОборот), 0) КАК СуммаБезСкидокНакопление
		|ИЗ
		|	ВТ_Запасы КАК ВТ_Запасы,
		|	(ВЫБРАТЬ
		|		СУММА(БалыЛояльностиОбороты.СуммаОборот) КАК СуммаОборот
		|	ИЗ
		|		РегистрНакопления.БалыЛояльности.Обороты(, &ДатаДокумента, Регистратор, Контрагент = &Контрагент) КАК БалыЛояльностиОбороты
		|	ГДЕ
		|		БалыЛояльностиОбороты.Регистратор <> &Ссылка
		|) КАК ВложенныйЗапрос
		
		|";
	
	Запрос.УстановитьПараметр("тзЗапасы", тзЗапасы);     
	Если ЗначениеЗаполнено(объект.Ссылка) Тогда 
		Запрос.УстановитьПараметр("ДатаДокумента", Объект.Дата);  
	Иначе
		Запрос.УстановитьПараметр("ДатаДокумента", ТекущаяДата());
	КонецЕсли;
	Запрос.УстановитьПараметр("Контрагент", Объект.Контрагент);
	Запрос.УстановитьПараметр("КартаЛояльности", Объект.КартаЛояльности);  
	Запрос.УстановитьПараметр("Ссылка", Объект.Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ВсегоПоДокументу = ВыборкаДетальныеЗаписи.СуммаБезСкидок;       
		ВсегоПоДокументуНакопление = ВыборкаДетальныеЗаписи.СуммаБезСкидокНакопление + ВыборкаДетальныеЗаписи.СуммаБезСкидок;
	КонецЦикла;
	
	СуммаПорогаПоКарте = 0;
	ПроцентПорога = 0;
		
	Если Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() > 0 Тогда   
		
		СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[0].НижняяГраницаЛояльность;
		
		Для Сч = 0 По Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() - 1 Цикл 
			
			//Если ВсегоПоДокументуНакопление >= СуммаПорогаПоКарте Тогда 
			Если ВсегоПоДокументу >= СуммаПорогаПоКарте Тогда //Малышев 2024-12-26 - по одному документу
				ПроцентПорога = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[СЧ].СкидкаЛояльность;
				Если Сч <> Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1.Количество() - 1 Тогда 
					СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок1[СЧ+1].НижняяГраницаЛояльность;
				Иначе
					Прервать;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;     
		
		Если ПроцентПорога <> 0 Тогда  
			Возврат ПроцентПорога;
		КонецЕсли;    
		
	КонецЕсли;
	
	//ВсегоПоДокументу = Объект.Запасы.Итог("Сумма");
	ВсегоПоДокументу = Объект.Запасы.Итог("Всего");
	
	Если Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() > 0 Тогда             
		
		СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[0].НижняяГраницаЛояльность;
		
		Для Сч = 0 По Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Цикл 
			
			Если ВсегоПоДокументу >= СуммаПорогаПоКарте Тогда 
				ПроцентПорога = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ].СкидкаЛояльность;
				Если Сч <> Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок.Количество() - 1 Тогда 
					СуммаПорогаПоКарте = Объект.КартаЛояльности.Владелец.ПорогиНакопительныхСкидок[СЧ+1].НижняяГраницаЛояльность;
				Иначе
					Прервать;
				КонецЕсли;
			Иначе
				Прервать;
			КонецЕсли;
			
		КонецЦикла;        
	КонецЕсли;
	
	Возврат ПроцентПорога;

КонецФункции // ПолучитьПроцентНакопления()


Функция ПолучитьТекстЗапросаИнициализации_РасходнаяНакладная() Экспорт
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РасходнаяНакладнаяЗапасы.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА РасходнаяНакладнаяЗапасы.Проект
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Организация КАК Организация,
	|	РасходнаяНакладнаяЗапасы.СтавкаНДС КАК СтавкаНДС,
	|	РасходнаяНакладнаяЗапасы.Ссылка.СчетУчетаСвободнаяпродажа КАК СчетУчетаСвободнаяпродажа,
	|	РасходнаяНакладнаяЗапасы.Ссылка КАК Регистратор,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Дата КАК Период,
	|	РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности КАК КартаЛояльности,
	|	РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.Владелец.СчетУчетаРегл КАК КартаЛояльностиСчетУчетаРегл,
	|	РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.Владелец.СчетВыручкиОтПродажиБалловРегл КАК КартаЛояльностиСчетВыручкиОтПродажиБалловРегл,
	|	РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.Владелец.КоэфициентПересчета КАК КоэфициентПересчета,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл, 
	|	РасходнаяНакладнаяЗапасы.Ссылка.Договор КАК Договор,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	РасходнаяНакладнаяЗапасы.Ссылка.ВидНалогаНДС КАК ВидНалогаНДС,
	|	РасходнаяНакладнаяЗапасы.Ссылка.Контрагент КАК Контрагент,
	|	РасходнаяНакладнаяЗапасы.Номенклатура КАК Номенклатура,
	|	РасходнаяНакладнаяЗапасы.Сумма КАК Сумма,
	|	РасходнаяНакладнаяЗапасы.Всего КАК Всего,  //Малышев 2024-10-31
	|	РасходнаяНакладнаяЗапасы.СуммаНДСБаллов КАК СуммаНДСБаллов, //Малышев 2024-10-31
	|   УчетнаяПолитикаРегл.СчетДляПредоплаченныхРасходовРегл как СчетДляПредоплаченныхРасходовРегл,
	
	//=================СуммаВыручкиОтПродажи======================
	//|	ВЫРАЗИТЬ(
	//|		(РасходнаяНакладнаяЗапасы.Сумма 
	//|			- (РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	//|				* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) 
	//|			- РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) / 1.18 
	//|	КАК ЧИСЛО(15, 2)
	//|	) КАК СуммаВыручкиОтПродажи,
    |	РасходнаяНакладнаяЗапасы.Всего 
	|		- РасходнаяНакладнаяЗапасы.КоличествоНакопленныхБаллов 
	|		- РасходнаяНакладнаяЗапасы.БалыРасход 
	|		- РасходнаяНакладнаяЗапасы.СуммаНДСЛояльности 
	|	КАК СуммаВыручкиОтПродажи,
	//=================СуммаВыручкиОтПродажи======================
	
	//=================СуммаРегл======================
	//|	ВЫРАЗИТЬ(
	//|		(РасходнаяНакладнаяЗапасы.Сумма 
	//|			- (РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	//|				* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) 
	//|			- РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) / 1.18 
	//|	КАК ЧИСЛО(15, 2)
	//|	) КАК СуммаРегл,
    |	РасходнаяНакладнаяЗапасы.Всего 
	|		- РасходнаяНакладнаяЗапасы.КоличествоНакопленныхБаллов 
	|		- РасходнаяНакладнаяЗапасы.БалыРасход 
	|		- РасходнаяНакладнаяЗапасы.СуммаНДСЛояльности 
	|	КАК СуммаРегл,
    //=================СуммаРегл======================
	
	
	//=================СуммаНДСРегл======================
	//|	РасходнаяНакладнаяЗапасы.Сумма 
	//|	- (РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	//|		* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) 
	//|	- РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета 
	//|	- (ВЫРАЗИТЬ((РасходнаяНакладнаяЗапасы.Сумма 
	//|				- (РасходнаяНакладнаяЗапасы.Сумма - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	//|					* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) 
	//|				- РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) / 1.18 КАК ЧИСЛО(15, 2))) 
	//|	КАК СуммаНДСРегл,
	
	|	РасходнаяНакладнаяЗапасы.Всего 
	|	- (РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	|		* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) 
	|	- РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета 
	|	- (ВЫРАЗИТЬ((РасходнаяНакладнаяЗапасы.Всего 
	|				- (РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	|					* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) 
	|				- РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) / 1.18 КАК ЧИСЛО(15, 2))) 
	|	КАК СуммаНДСРегл,
	//=================СуммаНДСРегл======================
	
	
	
	|	РасходнаяНакладнаяЗапасы.Ссылка.ВидИспользоыванияБалов КАК ВидИспользоыванияБалов,
	
	//Малышев 2024-11-01 ONESOFT-3558
	//|	ВЫРАЗИТЬ(
	//|		ВЫБОР
	//|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности<>Значение(Справочник.КартыЛояльности.ПустаяСсылка) 
	//|	    	   ТОГДА
	//|       	      (РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.БалыРасход * РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.Владелец.КоэфициентПересчета)*(РасходнаяНакладнаяЗапасы.Ссылка.ПроцентНакопленияБалов / 100)   
	//|			ИНАЧЕ 0   	
	//|   	КОНЕЦ КАК Число(15,2)) 
	//|	КАК КоличествоНакопленныхБаллов, 
	|   РасходнаяНакладнаяЗапасы.КоличествоНакопленныхБаллов как КоличествоНакопленныхБаллов,
	
	//|	ВЫРАЗИТЬ(
	//|		ВЫБОР
	//|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности<>Значение(Справочник.КартыЛояльности.ПустаяСсылка) 
	//|	    	   ТОГДА
	//|       	      (РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.БалыРасход * РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.Владелец.КоэфициентПересчета)*(РасходнаяНакладнаяЗапасы.Ссылка.ПроцентНакопленияБалов / 100)   
	//|			ИНАЧЕ 0   	
	//|   	КОНЕЦ * 18/118 КАК Число(15,2)) 
	//|	КАК СуммаНДСНакопленныхБаллов, 
	|   РасходнаяНакладнаяЗапасы.СуммаНДСНакопленныхБаллов как СуммаНДСНакопленныхБаллов,
	
	|
	|	РасходнаяНакладнаяЗапасы.БалыРасход как КоличествоИзрасходованныхБаллов,
	//|	ВЫРАЗИТЬ(
	//|		ВЫБОР
	//|			КОГДА РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности<>Значение(Справочник.КартыЛояльности.ПустаяСсылка) 
	//|		       ТОГДА 
	//|					(РасходнаяНакладнаяЗапасы.Всего
	//|   	           - (РасходнаяНакладнаяЗапасы.Всего - РасходнаяНакладнаяЗапасы.БалыРасход * РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.Владелец.КоэфициентПересчета)*(РасходнаяНакладнаяЗапасы.Ссылка.ПроцентНакопленияБалов / 100)   
	//|				   - РасходнаяНакладнаяЗапасы.БалыРасход) * 18/118	
	//|			ИНАЧЕ 0   	
	//|   	КОНЕЦ КАК ЧИСЛО(15,2))
	//|	КАК СуммаНДСЛояльности, 
	|   РасходнаяНакладнаяЗапасы.СуммаНДСЛояльности как СуммаНДСЛояльности,
	//Алгоритм: СуммаНДСЛояльности = (Объект.Запасы.Итог("Всего") - КоличествоНакопленныхБаллов - Объект.Запасы.Итог("БалыРасход"))*18/118;
	
	//Малышев 2024-11-01 ONESOFT-3558                                           
	
	
	//|	(РасходнаяНакладнаяЗапасы.Сумма 
	//|		- РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	//|	* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) 
	//|	КАК КоличествоПриход,
	|	РасходнаяНакладнаяЗапасы.КоличествоНакопленныхБаллов КАК КоличествоПриход,
	
	
	//=================СуммаНДСРегл======================
	//|	(РасходнаяНакладнаяЗапасы.Сумма 
	//|		- РасходнаяНакладнаяЗапасы.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	//|	* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) * ВТ_ПарогиЛояльности.КоэфициентПересчета 
	//|	КАК КоличествоПриходРегл,
	|	РасходнаяНакладнаяЗапасы.КоличествоНакопленныхБаллов * ВТ_ПарогиЛояльности.КоэфициентПересчета КАК КоличествоПриходРегл,
	//=================СуммаНДСРегл======================
	
	
	|	-РасходнаяНакладнаяЗапасы.БалыРасход КАК КоличествоРасход,
	|	ВТ_ПарогиЛояльности.СкидкаЛояльность КАК СкидкаЛояльность,
	|	ВЫБОР
	|		КОГДА КонстантаСчетВыручкиВТабличнойЧасти.Значение
	|			ТОГДА ВЫБОР
	|					КОГДА РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Договор.ЭтоДоговорОбслуживания
	|												И РасходнаяНакладнаяЗапасы.Ссылка.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|											ТОГДА ИСТИНА
	|										ИНАЧЕ ЛОЖЬ
	|									КОНЕЦ
	|									ТОГДА РасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|								ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|							КОНЕЦ
	|					ИНАЧЕ РасходнаяНакладнаяЗапасы.СчетУчетаВыручкиОтПродажРегл
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА РасходнаяНакладнаяЗапасы.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|					ТОГДА РасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|				КОГДА ВЫБОР
	|						КОГДА РасходнаяНакладнаяЗапасы.Ссылка.Договор.ЭтоДоговорОбслуживания
	|								И РасходнаяНакладнаяЗапасы.Ссылка.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|					ТОГДА РасходнаяНакладнаяЗапасы.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|				ИНАЧЕ РасходнаяНакладнаяЗапасы.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчетаПродажиРегл
	|ПОМЕСТИТЬ ВременнаяТаблицаБалыЛояльности
	|ИЗ
	|	Документ.РасходнаяНакладная.Запасы КАК РасходнаяНакладнаяЗапасы
	|      ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&НаДату, Организация = &Организация) как УчетнаяПолитикаРегл
	|		ПО РасходнаяНакладнаяЗапасы.Ссылка.Организация = УчетнаяПолитикаРегл.Организация
	|,
	|	ВТ_ПарогиЛояльности КАК ВТ_ПарогиЛояльности,
	|	Константа.СчетВыручкиВТабличнойЧасти КАК КонстантаСчетВыручкиВТабличнойЧасти
	|ГДЕ
	|	РасходнаяНакладнаяЗапасы.Ссылка = &Ссылка
	|	И РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|	И &НаДату между РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.ДатаНачала и  КОНЕЦПЕРИОДА(РасходнаяНакладнаяЗапасы.Ссылка.КартаЛояльности.ДатаОкончания,ДЕНЬ)
	|";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПолучитьТекстЗапросаИнициализации_ПриходнаяНакладнаяВозврат() Экспорт
	
	ТекстЗапроса = "
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗапасыДокумента.НомерСтроки КАК НомерСтроки,
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам
	|			ТОГДА ЗапасыДокумента.Проект
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.ПустаяСсылка)
	|	КОНЕЦ КАК Проект,
	|	ЗапасыДокумента.Ссылка.Организация КАК Организация,
	|	ЗапасыДокумента.СтавкаНДС КАК СтавкаНДС,
	|	ЗапасыДокумента.Ссылка.ДокументОснование.СчетУчетаСвободнаяпродажа КАК СчетУчетаСвободнаяпродажа,
	|	ЗапасыДокумента.Ссылка КАК Регистратор,
	|	ЗапасыДокумента.Ссылка.Дата КАК Период,
	|	ЗапасыДокумента.Ссылка.КартаЛояльности КАК КартаЛояльности,
	|	ЗапасыДокумента.Ссылка.КартаЛояльности.Владелец.СчетУчетаРегл КАК КартаЛояльностиСчетУчетаРегл,
	|	ЗапасыДокумента.Ссылка.КартаЛояльности.Владелец.СчетВыручкиОтПродажиБалловРегл КАК КартаЛояльностиСчетВыручкиОтПродажиБалловРегл,
	|	ЗапасыДокумента.Ссылка.КартаЛояльности.Владелец.КоэфициентПересчета КАК КоэфициентПересчета,
	|	ЗапасыДокумента.Ссылка.Контрагент.СчетУчетаРасчетовСПокупателемРегл КАК СчетУчетаРасчетовСПокупателемРегл, 
	|	ЗапасыДокумента.Ссылка.Договор КАК Договор,
	|	ЗапасыДокумента.Ссылка.ВалютаДокумента КАК ВалютаДокумента,
	|	ЗапасыДокумента.Ссылка.ВидНалогаНДС КАК ВидНалогаНДС,
	|	ЗапасыДокумента.Ссылка.Контрагент КАК Контрагент,
	|	ЗапасыДокумента.Номенклатура КАК Номенклатура,
	|	ЗапасыДокумента.Сумма КАК Сумма,
	|	ЗапасыДокумента.Всего КАК Всего,  //Малышев 2024-10-31
	|	ЗапасыДокумента.СуммаНДСБаллов КАК СуммаНДСБаллов, //Малышев 2024-10-31
	|   УчетнаяПолитикаРегл.СчетДляПредоплаченныхРасходовРегл как СчетДляПредоплаченныхРасходовРегл,
	|	ВЫРАЗИТЬ((ЗапасыДокумента.Сумма - (ЗапасыДокумента.Сумма - ЗапасыДокумента.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) - ЗапасыДокумента.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) / 1.18 КАК ЧИСЛО(15, 2)) КАК СуммаРегл,
	|	ЗапасыДокумента.Сумма - (ЗапасыДокумента.Сумма - ЗапасыДокумента.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) - ЗапасыДокумента.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета - (ВЫРАЗИТЬ((ЗапасыДокумента.Сумма - (ЗапасыДокумента.Сумма - ЗапасыДокумента.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) * (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) - ЗапасыДокумента.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) / 1.18 КАК ЧИСЛО(15, 2))) КАК СуммаНДСРегл,
	|	ЗапасыДокумента.Ссылка.ВидИспользованияБалов КАК ВидИспользованияБалов,
	
	|   ЗапасыДокумента.КоличествоНакопленныхБаллов как КоличествоНакопленныхБаллов,
	
	|   ЗапасыДокумента.СуммаНДСНакопленныхБаллов как СуммаНДСНакопленныхБаллов,
	
	|
	|	ЗапасыДокумента.БалыРасход как КоличествоИзрасходованныхБаллов,
	|   ЗапасыДокумента.СуммаНДСЛояльности как СуммаНДСЛояльности,
	//Алгоритм: СуммаНДСЛояльности = (Объект.Запасы.Итог("Всего") - КоличествоНакопленныхБаллов - Объект.Запасы.Итог("БалыРасход"))*18/118;
	
	|	ЗапасыДокумента.КоличествоНакопленныхБаллов КАК КоличествоПриход,
	
	|	(ЗапасыДокумента.Сумма 
	|		- ЗапасыДокумента.БалыРасход * ВТ_ПарогиЛояльности.КоэфициентПересчета) 
	|	* (ВТ_ПарогиЛояльности.СкидкаЛояльность / 100) * ВТ_ПарогиЛояльности.КоэфициентПересчета 
	|	КАК КоличествоПриходРегл,
	
	|	-ЗапасыДокумента.БалыРасход КАК КоличествоРасход,
	|	ВТ_ПарогиЛояльности.СкидкаЛояльность КАК СкидкаЛояльность,
	|	ВЫБОР
	|		КОГДА КонстантаСчетВыручкиВТабличнойЧасти.Значение
	|			ТОГДА ВЫБОР
	|					КОГДА ЗапасыДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл = ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|						ТОГДА ВЫБОР
	|								КОГДА ВЫБОР
	|										КОГДА ЗапасыДокумента.Ссылка.Договор.ЭтоДоговорОбслуживания
	|												И ЗапасыДокумента.Ссылка.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|											ТОГДА ИСТИНА
	|										ИНАЧЕ ЛОЖЬ
	|									КОНЕЦ
	|									ТОГДА ЗапасыДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|								ИНАЧЕ ЗапасыДокумента.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|							КОНЕЦ
	|					ИНАЧЕ ЗапасыДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|				КОНЕЦ
	|		ИНАЧЕ ВЫБОР
	|				КОГДА ЗапасыДокумента.НаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|					ТОГДА ЗапасыДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|				КОГДА ВЫБОР
	|						КОГДА ЗапасыДокумента.Ссылка.Договор.ЭтоДоговорОбслуживания
	|								И ЗапасыДокумента.Ссылка.Договор.ДоговорОбслуживанияНаправлениеДеятельности <> ЗНАЧЕНИЕ(Справочник.НаправленияДеятельности.ПустаяСсылка)
	|							ТОГДА ИСТИНА
	|						ИНАЧЕ ЛОЖЬ
	|					КОНЕЦ
	|					ТОГДА ЗапасыДокумента.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|				ИНАЧЕ ЗапасыДокумента.Номенклатура.НаправлениеДеятельности.СчетУчетаВыручкиОтПродажРегл
	|			КОНЕЦ
	|	КОНЕЦ КАК СчетУчетаПродажиРегл
	|ПОМЕСТИТЬ ВременнаяТаблицаБалыЛояльности
	|ИЗ
	|	Документ.ПриходнаяНакладная.Запасы КАК ЗапасыДокумента
	|      ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.УчетнаяПолитикаРегл.СрезПоследних(&ДатаСреза, Организация = &Организация) как УчетнаяПолитикаРегл
	|		ПО ЗапасыДокумента.Ссылка.Организация = УчетнаяПолитикаРегл.Организация
	|,
	|	ВТ_ПарогиЛояльности КАК ВТ_ПарогиЛояльности,
	|	Константа.СчетВыручкиВТабличнойЧасти КАК КонстантаСчетВыручкиВТабличнойЧасти
	|ГДЕ
	|	ЗапасыДокумента.Ссылка = &Ссылка
	|	И ЗапасыДокумента.Ссылка.ВидОперации = Значение(Перечисление.ВидыОперацийПриходнаяНакладная.ВозвратОтПокупателя)
	|	И ЗапасыДокумента.Ссылка.КартаЛояльности <> ЗНАЧЕНИЕ(Справочник.ДисконтныеКарты.ПустаяСсылка)
	|	И &ДатаСреза между ЗапасыДокумента.Ссылка.КартаЛояльности.ДатаНачала и  КОНЕЦПЕРИОДА(ЗапасыДокумента.Ссылка.КартаЛояльности.ДатаОкончания,ДЕНЬ)
	|";
	        
	Возврат ТекстЗапроса;
	
КонецФункции
